IDEA Open Model
CrossSectionParameter Properties
Compatible with IDEA StatiCa Beta 20.0
The CrossSectionParameter type exposes the following members.
Properties
Name | Description
CrossSectionRotation
 Rotation of Cross - Section
 (Inherited from CrossSection.)
CrossSectionType
 Type of cross-section
Id
 Element Id
 (Inherited from OpenElementId.)
Material
 Material
Name
 Name of cross-section
 (Inherited from CrossSection.)
Parameters
 Parameters
Top
See Also
Reference
CrossSectionParameter Class
IdeaRS.OpenModel.CrossSection Namespace